// 주석
// 컴파일 시 컴파일러가 주석처리된 내용을 모두 지웁니다.
// 적성자 : 박종현
// 날 짜  : 2024-06-11
// 학습내용 : 컴파일러, Hello World, 주석
 
// 단축기 : Alt + Shift + 키포드 화살표 위, 아래
// 기능   : 코드 일괄 수정

// 주석 작성 방법2
// 방법 : /*   ~~~ */
/* 주석
컴파일 시 컴파일러가 주석처리된 내용을 모두 지웁니다.
 
적성자 : 박종현
 
날 짜  : 2024-06-11
 
학습내용 : 컴파일러, Hello World, 주석

*/

#include <stdio.h>

int main() 
{
    printf("  ●●    ●● \n");
    printf(" ● ●●●● ● \n");
    printf(" ● ○   ○ ● \n");
    printf("  ●●   ●● \n");
    printf(" ●●     ● \n");
    printf("●●  ●● ● \n");
    printf("  ●●   ●● \n");
    printf(" ●●     ●● \n");
    return 0;
}